Revit 2027 API
DirectShapeTypeOptions.AllowDuplicateNames Property
 Determines whether or not duplicate DirectShapeType names are allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowDuplicateNames { get; set; }
Public Property AllowDuplicateNames As Boolean
	Get
	Set
public:
property bool AllowDuplicateNames {
	bool get ();
	void set (bool value);
}
member AllowDuplicateNames : bool with get, set
Property Value
Boolean
See Also
Reference
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace